# Вход на трицифрено число
number = int(input())

# Взимаме цифрите
c1 = number % 10        # единици
c2 = (number // 10) % 10  # десетици
c3 = (number // 100) % 10 # стотици

# Проверка за валидност (цифрите не трябва да са 0)
if c1 == 0 or c2 == 0 or c3 == 0:
    print("Цифрите не могат да са 0!")
else:
    # Генерираме таблицата за умножение
    for i in range(1, c1 + 1):
        for j in range(1, c2 + 1):
            for k in range(1, c3 + 1):
                print(f"{i} * {j} * {k} = {i*j*k};")
